tap "d12frosted/emacs-plus"

brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "just"
brew "wget"
brew "ripgrep"
brew "starship"
brew "stow"
brew "vips"
brew "zoxide"
brew "bash"
brew "node"
brew "imagemagick"
brew "neovim"

brew "hunspell"
brew "aspell"
brew "libtool"
brew "cmake"
brew "coreutils"
brew "gcc"
brew "d12frosted/emacs-plus/emacs-plus@30"

brew "fish-lsp"

# Python
brew "pyright"
brew "uv"

# Go
brew "go"
brew "gopls"

cask "Vivaldi"
cask "font-iosevka-term-nerd-font"
cask "jagex"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "stremio"
